# Database creation

In [2]:
# import required libraries
import pandas as pd
import sqlite3

In [3]:
# Define the data
data1 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['crane']*10,
    'location': ['pune']*10,
}

data2 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['crane']*10,
    'location': ['nashik']*10,
}

data3 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['crane']*10,
    'location': ['mumbai']*10,
}

data4 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['jcb']*10,
    'location': ['pune']*10,
}

data5 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['jcb']*10,
    'location': ['nashik']*10,
}

data6 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['jcb']*10,
    'location': ['mumbai']*10,
}

data7 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['roller']*10,
    'location': ['pune']*10,
}

data8 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['roller']*10,
    'location': ['nashik']*10,
}

data9 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['roller']*10,
    'location': ['mumbai']*10,
}

data10 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['bulldozer']*10,
    'location': ['pune']*10,
}

data11 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['bulldozer']*10,
    'location': ['nashik']*10,
}

data12 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['bulldozer']*10,
    'location': ['mumbai']*10,
}

data13 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['excavator']*10,
    'location': ['pune']*10,
}

data14 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['excavator']*10,
    'location': ['nashik']*10,
}

data15 = {
    'equipment_id': [1,2,3,4,5,6,7,8,9,10],
    'equipment_name': ['excavator']*10,
    'location': ['mumbai']*10,
}

In [4]:
# Concatenate the data into a single DataFrame
df = pd.concat([pd.DataFrame(data1), pd.DataFrame(data2),pd.DataFrame(data3),pd.DataFrame(data4)
               ,pd.DataFrame(data5),pd.DataFrame(data6),pd.DataFrame(data7),pd.DataFrame(data8)
               ,pd.DataFrame(data9),pd.DataFrame(data10),pd.DataFrame(data11),pd.DataFrame(data12)
               ,pd.DataFrame(data13),pd.DataFrame(data14),pd.DataFrame(data15)])

In [5]:
df.head()

   equipment_id equipment_name location
0             1          crane     pune
1             2          crane     pune
2             3          crane     pune
3             4          crane     pune
4             5          crane     pune

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 0 to 9
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   equipment_id    150 non-null    int64
 1   equipment_name  150 non-null    object
 2   location        150 non-null    object
dtypes: int64(1), object(2)
memory usage: 4.7+ KB

In [7]:
# Define the SQL database connection
conn = sqlite3.connect('my_database.db')

# Store the DataFrame in a SQL table
df.to_sql('my_table', conn, if_exists='replace', index=False)

# Close the database connection
conn.close()

In [8]:
# Define the SQL database connection
conn = sqlite3.connect('my_database.db')

# Execute a SQL query to select all rows from the table
query = 'SELECT * FROM my_table where location = "pune"'
df = pd.read_sql_query(query, conn)

# Print the DataFrame
print(df.head())

# Close the database connection
conn.close()

   equipment_id equipment_name location
0             1          crane     pune
1             2          crane     pune
2             3          crane     pune
3             4          crane     pune
4             5          crane     pune